applications/rust/integration/benchmark.yaml
config:
  target: "http://127.0.0.1:80" #TODO: Override with artillery command
  phases:
    - duration: 15
      arrivalRate: 1
      rampTo: 10
      name: Warm up
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Burn
    - duration: 60
      arrivalRate: 30
      name: Sustained
    - duration: 15
      arrivalRate: 10
      rampTo: 50
      name: Spike
    - duration: 20
      arrivalRate: 5
      name: End

  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: "Navigate Menus"
    flow:
      - get:
          url: "/"
      - get:
          url: "/category/FRONT_PAGE/products"
      - post:
          url: "/products/"
          json: "shirt"
      - post:
          url: "/products/"
          json: "keyboard"